/*指针与数组之间的关系 进阶*/
#include<stdio.h>
int main()
{
    // int i = 1;
    // int a = 2;
    // int b = 3;
    // int c = 4;
    // int d = 5;
    // int *p[5] = {&i,&a,&b,&c,&d};
    // for(int k = 0;k<5;k++)
    // {
    //     printf("该指针数组输出的值为:%d\n",*p[k]);
    // }
    // return 0;

    // char *p[5] = {
    //     "我叫张家园",
    //     "今年十八岁",
    //     "来自河南省安阳市",
    //     "在南阳理工上大学",
    //     "学的是渗透与测试"
    // };
    // for(int i =0;i<5;i++)
    // {
    //     printf("%s\n",p[i]);
    // }
    // return 0;


    //数组指针
    //注意数组指针指向的地址是数组地址，但是必须加入&。因为之前不加入的原因是默认第一个元素与数组名是相同的地址；
    //数组指针与二维数组相似
    int p[5] = {1,2,3,4,5};
    int (*ptr)[5] = &p;
    for(int i = 0;i < 5;i++)
    {
        printf("%d\n",*(*ptr + i));
    }
    return 0;
}